; domain
(define (domain barman)
  (:requirements :strips :typing)
  (:types hand level beverage dispenser container - object
  	  ingredient cocktail - beverage
          shot shaker - container)
  (:predicates  (ontable ?c - container)
                (holding ?h - hand ?c - container)
		(handempty ?h - hand)
		(empty ?c - container)
                (contains ?c - container ?b - beverage)
		(clean ?c - container)
                (used ?c - container ?b - beverage)
                (dispenses ?d - dispenser ?i - ingredient)
		(shaker_empty_level ?s - shaker ?l - level)
		(shaker_level ?s - shaker ?l - level)
		(next ?l1 ?l2 - level)
		(unshaked ?s - shaker)
		(shaked ?s - shaker)
                (cocktail_part1 ?c - cocktail ?i - ingredient)
                (cocktail_part2 ?c - cocktail ?i - ingredient))
		
  (:action grasp
             :parameters (?h - hand ?c - container)
             :precondition (and (ontable ?c) (handempty ?h))
             :effect (and (not (ontable ?c))
	     	     	  (not (handempty ?h))
			  (holding ?h ?c)))

  (:action leave
             :parameters (?h - hand ?c - container)
             :precondition (holding ?h ?c)
             :effect (and (not (holding ?h ?c))
	     	     	  (handempty ?h)
			  (ontable ?c)))
  
  (:action fill_shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (clean ?s))
           :effect (and (not (empty ?s))
	   	   	(contains ?s ?i)
	   	   	(not (clean ?s))
			(used ?s ?i)))


  (:action refill_shot
           :parameters (?s - shot ?i - ingredient ?h1 ?h2 - hand ?d - dispenser)
           :precondition (and (holding ?h1 ?s)	   		      
                              (handempty ?h2)
	   		      (dispenses ?d ?i)
                              (empty ?s)
			      (used ?s ?i))
           :effect (and (not (empty ?s))
                        (contains ?s ?i)))

  (:action empty_shot
           :parameters (?h - hand ?p - shot ?b - beverage)
           :precondition (and (holding ?h ?p)
                              (contains ?p ?b))
           :effect (and (not (contains ?p ?b))
	   	   	(empty ?p)))

  (:action clean_shot
  	   :parameters (?s - shot ?b - beverage ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)	   		      
			      (empty ?s)
                              (used ?s ?b))
           :effect (and (not (used ?s ?b))
	   	   	(clean ?s)))

  (:action pour_shot_to_clean_shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (empty ?d)
	   		      (clean ?d)                              
                              (shaker_level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
	   	   	(empty ?s)
			(contains ?d ?i)
                        (not (empty ?d))
			(not (clean ?d))
			(unshaked ?d)
			(not (shaker_level ?d ?l))
			(shaker_level ?d ?l1)))


  (:action pour_shot_to_used_shaker
           :parameters (?s - shot ?i - ingredient ?d - shaker ?h1 - hand ?l ?l1 - level)
           :precondition (and (holding ?h1 ?s)
			      (contains ?s ?i)
                              (unshaked ?d)
                              (shaker_level ?d ?l)
                              (next ?l ?l1))
           :effect (and (not (contains ?s ?i))
                        (contains ?d ?i)
	   	   	(empty ?s)     
  			(not (shaker_level ?d ?l))
			(shaker_level ?d ?l1)))

  (:action empty_shaker
           :parameters (?h - hand ?s - shaker ?b - cocktail ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
                              (contains ?s ?b)
			      (shaked ?s)
			      (shaker_level ?s ?l)
			      (shaker_empty_level ?s ?l1))
           :effect (and (not (shaked ?s))
	   	   	(not (shaker_level ?s ?l))
	   	   	(shaker_level ?s ?l1)
			(not (contains ?s ?b))
	   	   	(empty ?s)))

  (:action clean_shaker
  	   :parameters (?h1 ?h2 - hand ?s - shaker)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
                              (empty ?s))
           :effect (and (clean ?s)))
  
  (:action shake
  	   :parameters (?b - cocktail ?d1 ?d2 - ingredient ?s - shaker ?h1 ?h2 - hand)
           :precondition (and (holding ?h1 ?s)
                              (handempty ?h2)
			      (contains ?s ?d1)
                              (contains ?s ?d2)
                              (cocktail_part1 ?b ?d1)
			      (cocktail_part2 ?b ?d2)
			      (unshaked ?s))			      
           :effect (and (not (unshaked ?s))
		        (not (contains ?s ?d1))
                        (not (contains ?s ?d2))
	   	   	(shaked ?s)
                        (contains ?s ?b)))

  (:action pour_shaker_to_shot
           :parameters (?b - beverage ?d - shot ?h - hand ?s - shaker ?l ?l1 - level)
           :precondition (and (holding ?h ?s)
			      (shaked ?s)
			      (empty ?d)
			      (clean ?d)
			      (contains ?s ?b)
                              (shaker_level ?s ?l)
                              (next ?l1 ?l))
           :effect (and (not (clean ?d))
	   	   	(not (empty ?d))
			(contains ?d ?b)
			(shaker_level ?s ?l1)
			(not (shaker_level ?s ?l))))
 )

; problem
(define (problem prob)
 (:domain barman)
 (:objects 
     shaker1 - shaker
     left right - hand
     shot1 shot2 - shot
     ingredient1 ingredient2 - ingredient
     cocktail1 - cocktail
     dispenser1 dispenser2 - dispenser
     l0 l1 l2 - level
)
 (:init 
  (ontable shaker1)
  (ontable shot1)
  (ontable shot2)
  (dispenses dispenser1 ingredient1)
  (dispenses dispenser2 ingredient2)
  (clean shaker1)
  (clean shot1)
  (clean shot2)
  (empty shaker1)
  (empty shot1)
  (empty shot2)
  (handempty left)
  (handempty right)
  (shaker_empty_level shaker1 l0)
  (shaker_level shaker1 l0)
  (next l0 l1)
  (next l1 l2)
  (cocktail_part1 cocktail1 ingredient2)
  (cocktail_part2 cocktail1 ingredient1)
)
 (:goal
  (and
     (contains shot1 cocktail1)
)))

; plan
1. (grasp left shot1)
   deleted: (ontable shot1) (handempty left)
   added: (holding left shot1)
   goals met: 0 of 1
2. (fill_shot shot1 ingredient1 left right dispenser1)
   deleted: (empty shot1) (clean shot1)
   added: (contains shot1 ingredient1) (used shot1 ingredient1)
   goals met: 0 of 1
3. (pour_shot_to_clean_shaker shot1 ingredient1 shaker1 left l0 l1)
   deleted: (contains shot1 ingredient1) (empty shaker1) (clean shaker1) (shaker_level shaker1 l0)
   added: (empty shot1) (contains shaker1 ingredient1) (unshaked shaker1) (shaker_level shaker1 l1)
   goals met: 0 of 1
4. (clean_shot shot1 ingredient1 left right)
   deleted: (used shot1 ingredient1)
   added: (clean shot1)
   goals met: 0 of 1
5. (fill_shot shot1 ingredient2 left right dispenser2)
   deleted: (empty shot1) (clean shot1)
   added: (contains shot1 ingredient2) (used shot1 ingredient2)
   goals met: 0 of 1
6. (pour_shot_to_used_shaker shot1 ingredient2 shaker1 left l1 l2)
   deleted: (contains shot1 ingredient2) (shaker_level shaker1 l1)
   added: (contains shaker1 ingredient2) (empty shot1) (shaker_level shaker1 l2)
   goals met: 0 of 1
7. (leave left shot1)
   deleted: (holding left shot1)
   added: (handempty left) (ontable shot1)
   goals met: 0 of 1
8. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 0 of 1
9. (shake cocktail1 ingredient2 ingredient1 shaker1 left right)
   deleted: (unshaked shaker1) (contains shaker1 ingredient2) (contains shaker1 ingredient1)
   added: (shaked shaker1) (contains shaker1 cocktail1)
   goals met: 0 of 1
10. (grasp right shot1)
   deleted: (ontable shot1) (handempty right)
   added: (holding right shot1)
   goals met: 0 of 1
11. (leave left shaker1)
   deleted: (holding left shaker1)
   added: (handempty left) (ontable shaker1)
   goals met: 0 of 1
12. (clean_shot shot1 ingredient2 right left)
   deleted: (used shot1 ingredient2)
   added: (clean shot1)
   goals met: 0 of 1
13. (grasp left shaker1)
   deleted: (ontable shaker1) (handempty left)
   added: (holding left shaker1)
   goals met: 0 of 1
14. (pour_shaker_to_shot cocktail1 shot1 left shaker1 l2 l1)
   deleted: (clean shot1) (empty shot1) (shaker_level shaker1 l2)
   added: (contains shot1 cocktail1) (shaker_level shaker1 l1)
   goals met: 1 of 1
